{
    "version": "https://jsonfeed.org/version/1",
    "title": "Agroconscious",
    "description": "",
    "home_page_url": "https://areahints.github.io/agroconscious",
    "feed_url": "https://areahints.github.io/agroconscious/feed.json",
    "user_comment": "",
    "icon": "https://areahints.github.io/agroconscious/media/website/agro.png",
    "author": {
        "name": "Agro Blogger"
    },
    "items": [
        {
            "id": "https://areahints.github.io/agroconscious/paste-processing-tomatoes-nigeria.html",
            "url": "https://areahints.github.io/agroconscious/paste-processing-tomatoes-nigeria.html",
            "title": "Paste Processing of Tomatoes in Nigeria, What you should know",
            "summary": "One thing about tomato paste is that it needs a lot of tomatoes to make. Tomatoes are about 95% water and 5% solids/sugar. The next time you reach for that can of tomato puree, check the concentrate percentage. Probably, the label will read “dual concentrate”&hellip;",
            "content_html": "<!-- wp:paragraph -->\n<p>One thing about <a href=\"http://www.tomatojos.net/08-tomato-paste-processing/\">tomato paste</a> is that it needs a lot of tomatoes to make. Tomatoes are about 95% water and 5% solids/sugar. The next time you reach for that can of tomato puree, check the concentrate percentage.</p>\n<!-- /wp:paragraph --> <!-- wp:paragraph -->\n<p>Probably, the label will read <em>“dual concentrate”</em> and the merchandise will contain about 28% solid materials (also called Brix). So if you’re making paste, you will need 5.6kgs of tomatoes with a 5% sugars content to make 1kg of tomato paste at 28% Brix.</p>\n<!-- /wp:paragraph --> <!-- wp:image -->\n<figure class=\"wp-block-image\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Tomato_paste_on_spoon.jpg/800px-Tomato_paste_on_spoon.jpg?1538136946250\" alt=\"tomato paste\"></figure>\n<!-- /wp:image --> <!-- wp:paragraph -->\n<p>There are two types of tomato paste - <strong>Hot Break and Cold Break,</strong> and they're used to get different end products. To create Hot Break (HB) paste, the new tomatoes must be warmed soon after chopping to a high temperature (ranging from 85 to 100°C).</p>\n<!-- /wp:paragraph --> <!-- wp:paragraph -->\n<p>Cold Break (CB) paste requires the fresh, cut tomatoes to be heated at a lesser temperature (which ranges from 65 to 75°C).</p>\n<!-- /wp:paragraph --> <!-- wp:paragraph -->\n<p>HB paste is usually used for ketchup and various types of tomato sauce needing a 28-30° Brix, while CB paste is used for triple concentrate paste at 36-38° Brix.</p>\n<!-- /wp:paragraph --> <!-- wp:paragraph -->\n<p>Tomato paste processing need a continual way to obtain fresh tomatoes, which is quite crucial for the tomato control series to operate at maximum capacity constantly.</p>\n<!-- /wp:paragraph --> <!-- wp:paragraph -->\n<p>If capacity drops below a certain threshold, or worse even, if paste can't be made at all in a day, then the process needs to halt while all the equipment is cleaned properly.</p>\n<!-- /wp:paragraph --> <!-- wp:heading {\"level\":3} -->\n<h3 id=\"mcetoc_1dbog4ab30\"><strong>Steps required for tomato paste processing.</strong></h3>\n<!-- /wp:heading --> <!-- wp:list -->\n<ul>\n<li>Fresh tomatoes in the trucks is taken to the offloading area. An operator, utilizing a special tube, sends a huge quantity of water into the pickup truck, so that the tomatoes can flow right out of the opening at the end of the trailer, Using water allows easy movement of tomatoes without damage.</li>\n</ul>\n<!-- /wp:list --> <!-- wp:image -->\n<figure class=\"wp-block-image\"><img src=\"http://www.botswanayouth.com/wp-content/uploads/2016/07/paste.jpg\" alt=\"Tomato Factory in Botswana\"></figure>\n<!-- /wp:image --> <!-- wp:list -->\n<ul>\n<li>Sorting: Water is constantly pumped to transport the tomatoes into roller elevator, rinse them, and then send the tomatoes to the sorting station. In the sorting station, materials besides the tomatoes are removed as well as discoloured, green and damaged tomatoes. This is usually done by hand, but some facilities possess the equipment for automated sorting.</li>\n<li>Chopping: The ideal tomatoes are pumped to the chopper area where they will be chopped.</li>\n<li>Cool or Hot Break: The pulp is pre-heated to 65-75°C for CH processing or to 85-95°C for HB processing.</li>\n<li>Juice Removal: The pulp (comprising fibre, juice, pores and skin and seeds) is then pumped via a removal unit made up of a pulper and a refiner, Typically, 95% of the pulp pass through both sieves. as a result, the remaining 5%, made up of fibre, seeds and skin, is considered waste and is transported from the station to be sold as feed for livestock.</li>\n<li>Holding tank: The enhanced juice is collected in a sizable holding tank, which feeds the evaporator constantly.</li>\n<li>Evaporation: This is where the water is extracted, and the juice that is still only 5% solid becomes 28% to 36% concentrated tomato paste. The evaporator regulates juice intake and finished concentrate output automatically; the operator only needs to set the Brix value on the control panel for the level of concentration needed.</li>\n</ul>\n<!-- /wp:list --> <!-- wp:quote -->\n<blockquote class=\"wp-block-quote\">\n<p>As the juice inside the evaporator goes through different stages, its concentration steadily increases until the required density is obtained in the ultimate “finisher” stage. The complete concentrate/evaporation process occurs under vacuum conditions, at temperatures below 100°C.</p>\n</blockquote>\n<!-- /wp:quote --> <!-- wp:list -->\n<ul>\n<li>Aseptic Filling: Most facilities package the completed product using aseptic bags, consequently the product in the evaporator never makes connection with air before the customer is reached.</li>\n<li>The concentrate is delivered from the evaporator right to an aseptic container, it is then pumped through the aseptic sterilizer-cooler (also known as a flash cooler) to the aseptic fillers, Once packed the concentrate can be kept up to two years.</li>\n</ul>\n<!-- /wp:list --> <!-- wp:image -->\n<figure class=\"wp-block-image\"><img src=\"https://bizwatchnigeria.ng/wp-content/uploads/2017/02/tomato-paste-660x330.jpg\" alt=\"Tomatoes\"></figure>\n<!-- /wp:image --> <!-- wp:paragraph -->\n<p>Some facilities choose to bundle their finished product under non-aseptic conditions, this paste must proceed through another step. It's warmed to pasteurize the paste, and then held under check for two weeks before it goes to the market.</p>\n<!-- /wp:paragraph --> <!-- wp:heading {\"level\":3} -->\n<h3 id=\"mcetoc_1dbog4ab41\">How Expensive is Tomato Paste Processing?</h3>\n<!-- /wp:heading --> <!-- wp:paragraph -->\n<p>Tomato paste processing is a capital and energy intensive venture. So when next you have to use a bottle of ketchup or some cooking paste, you’ll know how its processed.</p>\n<!-- /wp:paragraph --> <!-- wp:paragraph -->\n<p>Please use the <a href=\"http://www.fao.org/agriculture/seed/cropcalendar/welcome.do\">Crop Calendar</a> to learn more information about tomatoes. You can also view more topics at the <a href=\"http://www.worldbank.org/en/topic/agriculture/overview\">World Bank</a>. Also Follow us on <a href=\"instagram.com/agroconscious\">Instagram </a></p>\n<!-- /wp:paragraph -->",
            "author": {
                "name": "Agro Blogger"
            },
            "tags": [
            ],
            "date_published": "2019-05-25T23:00:42+01:00",
            "date_modified": "2019-05-25T23:00:42+01:00"
        },
        {
            "id": "https://areahints.github.io/agroconscious/tomatoes-health-benefits-nigerians.html",
            "url": "https://areahints.github.io/agroconscious/tomatoes-health-benefits-nigerians.html",
            "title": "Tomatoes and 9 health benefits it offers Nigerians",
            "summary": "One thing lovable about our Nigerian dishes is how well tomatoes seem to work with several of them. Either we slice and dice, or we grind into a pulpy or smooth texture (along with other things like peppers and onions). But besides just being good&hellip;",
            "content_html": "<!-- wp:paragraph -->\n<p>One thing lovable about our Nigerian dishes is how well tomatoes seem to work with several of them. Either we slice and dice, or we grind into a pulpy or smooth texture (along with other things like peppers and onions). But besides just being good for cooking and adding flavor, they are chockful of health benefits.</p>\n<!-- /wp:paragraph --> <!-- wp:quote -->\n<blockquote class=\"wp-block-quote\">\n<p>A lot of people say the tomato is the world healthiest fruit, let's look at 9 benefits today, you may call it a fruit or veggie. It's your decision.</p>\n</blockquote>\n<!-- /wp:quote --> <!-- wp:heading -->\n<h2 id=\"mcetoc_1dbm1euq10\">Advantages in your diet</h2>\n<!-- /wp:heading --> <!-- wp:image -->\n<figure class=\"wp-block-image\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/b/b1/Cherry_Nebula_tomatoes_2017_A1.jpg\" alt=\"tomatoes benefits\"></figure>\n<!-- /wp:image --> <!-- wp:paragraph -->\n<p>Here are the health advantages and more reasons why you should consider tomatoes farming in Nigeria;</p>\n<!-- /wp:paragraph --> <!-- wp:list {\"ordered\":true} -->\n<ol>\n<li>It helps with blood pressure management.</li>\n<li>They really help in maintaining healthy hair, vitamin A in tomato helps to make the hair shiny and strong.</li>\n<li>Tomatoes really help in preventing cancers; the exceptional thing is its capability to fight against cancers. Lycopene is an all-natural antioxidant that slows down the development of cancerous cells effectively, cooked tomatoes produce more lycopene.</li>\n<li>It fixes damages from smoking thanks to coumaric and chlorogenic acid that work together to protect the body from carcinogens created from tobacco smoke. For heavy smokers, they are something worth recommending for them to try out.</li>\n<li>It helps to keep the kidney in good form by preventing kidney stones.</li>\n<li>They are wonderful for the eyes and a perfect checker for sugar level; The Vitamin A present is a perfect treatment for improving eyesight and preventing night blindness, As a result, it also help patients with diabetes get blood sugar levels under control.</li>\n<li>Tomato provides essential antioxidants for the body's functioning; vitamins A and C provide antioxidant capabilities. These vitamins, alongside beta-carotene work together as antioxidants to neutralize dangerous free radicals in the bloodstream.</li>\n<li>They are good for your skin, it contains great level of lycopene which makes the skin look tender, smooth and shiny. it is also a good facial cleanser.</li>\n<li>It helps in maintaining strong bones; They include a significant quantity of calcium and Vitamin K. In general, these are known for helping with preserving strong bones.</li>\n</ol>\n<!-- /wp:list --> <!-- wp:paragraph -->\n<p>The benefits to human health that tomatoes give are numerous, with adequate nutrients in it, tomatoes is a choice fruit (or vegetable) for a healthy lifestyle.</p>\n<!-- /wp:paragraph --> <!-- wp:heading -->\n<h2 id=\"mcetoc_1dbm1euq11\">Tomatoes as a business in Nigeria</h2>\n<!-- /wp:heading --> <!-- wp:paragraph -->\n<p>It wouldn't be surprising that with all these health benefits and the delicacies that can be prepared with tomatoes, growing them especially is a profitable business one can embark on in Nigeria.</p>\n<!-- /wp:paragraph --> <!-- wp:heading -->\n<h2 id=\"mcetoc_1dbm1euq12\">Where in Nigeria can I grow tomatoes?</h2>\n<!-- /wp:heading --> <!-- wp:paragraph -->\n<p>With healthy soil and a good source of water, you can grow your tomatoes anywhere. There are some states that are well known for tomatoes farming in Nigeria. These states are;</p>\n<!-- /wp:paragraph --> <!-- wp:list -->\n<ul>\n<li>Bauchi State</li>\n<li>Taraba State</li>\n<li>Gombe State</li>\n<li>Kano State</li>\n<li>Zamfara State</li>\n<li>Jigawa State</li>\n<li>Sokoto State</li>\n<li>Katsina State</li>\n<li>Kaduna State</li>\n</ul>\n<!-- /wp:list --> <!-- wp:paragraph -->\n<p>These states are well known for tomatoes farming with local seed varieties to match, in the meantime, are you thinking of starting out your own tomato farming business? All you will need are the right equipment, seeds, conditions and you're set.</p>\n<!-- /wp:paragraph --> <!-- wp:paragraph -->\n<p>Please use the <a href=\"http://www.fao.org/agriculture/seed/cropcalendar/welcome.do\">Crop Calendar</a> to learn more information about tomatoes. You can also view more topics at the <a href=\"http://www.worldbank.org/en/topic/agriculture/overview\">World Bank</a> .</p>\n<!-- /wp:paragraph --> <!-- wp:paragraph -->\n<p>Do you have any questions concerning tomato and its health benefits? lets know on our <a href=\"http://localhost/seo/instagram.com/agroconscious\">Instagram Page</a></p>\n<!-- /wp:paragraph -->",
            "author": {
                "name": "Agro Blogger"
            },
            "tags": [
            ],
            "date_published": "2019-05-25T00:05:56+01:00",
            "date_modified": "2019-05-25T00:05:56+01:00"
        },
        {
            "id": "https://areahints.github.io/agroconscious/tomato-farming-guide-tips-nigerian-farmers.html",
            "url": "https://areahints.github.io/agroconscious/tomato-farming-guide-tips-nigerian-farmers.html",
            "title": "Tomato farming guide and tips for Nigerian farmers",
            "summary": "Setting up a tomato farm in Nigeria is not as difficult as it would seem, just like a couple of other fruits with simple enough management. It gets as basic as putting the seeds into the ground and covering it up with soil. In this&hellip;",
            "content_html": "<p>Setting up a tomato farm in Nigeria is not as difficult as it would seem, just like a couple of other fruits with simple enough management. It gets as basic as putting the seeds into the ground and covering it up with soil. In this post, we will walk you through the process of planting your very own tomato farm. Therefore this guide is meant to help you get the tomato farm you desire so that you can reap the benefits of tomato farming.</p>\n<p>This article is divided into the following parts</p>\n<ul>\n<li>Preparation</li>\n<li>Planting</li>\n<li>Harvesting</li>\n</ul>\n<h2 id=\"mcetoc_1dbm0fl5k0\"><strong>Preparation</strong></h2>\n<h3 id=\"mcetoc_1dbm0fl5l1\">Get an ideal site for your tomato farming</h3>\n<p>The first step you should take on this journey should you be finding a suitable location for your tomato farming.To begin with, it would be wise to select a place that is not too far from the marketplace. In addition, let there be ease of transportation in the vicinity so that you can easily transport your tomatoes when the time comes after harvesting.</p>\n<h3 id=\"mcetoc_1dbm0fl5l2\">Select healthy soil for your tomato farming</h3>\n<p>It is necessary to carefully decide on great soil for planting your tomatoes. Healthy soil will determine the kind of tomato which will be produced as well as the overall productivity of your tomato business.</p>\n<h3 id=\"mcetoc_1dbm0fl5l3\">Organic content of the soil is important</h3>\n<p>The soil should be a properly managed clay loam or sandy loam. It should be free from hardpan, keep in mind that the very best tomatoes are obtained from deep, well-drained loam. Also note that the soil needs to be abundant with organic matter and should be rich in plant nutrients, with a pH of 6 or 7.</p>\n<blockquote class=\"wp-block-quote\">\n<p>In preparing your land for the tomato farming, the soil ought to be loose with great tilt. Clear the soil of weeds and plough 1-3 times if it is heavy to make it lighter. In any case where the soil of your land is acidic, adding an appropriate amount of lime will help to either reduce or level the pH of the soil.</p>\n</blockquote>\n<h3 id=\"mcetoc_1dbm0fl5l4\">Pick the best tomato varieties</h3>\n<p>To get the very best from your own tomato farming you need to use the right varieties. The various varieties grown in the world are;</p>\n<ul>\n<li>Plum tomatoes</li>\n</ul>\n<ul>\n<li>Cherry tomatoes</li>\n</ul>\n<ul>\n<li>Grapes tomatoes</li>\n</ul>\n<ul>\n<li>Slicing or Globe tomatoes</li>\n</ul>\n<ul>\n<li>Campari tomatoes</li>\n</ul>\n<ul>\n<li>Tom berries tomatoes</li>\n</ul>\n<ul>\n<li>Oxheart tomatoes</li>\n</ul>\n<ul>\n<li>Beefsteak tomatoes</li>\n</ul>\n<ul>\n<li>Pear tomatoes</li>\n</ul>\n<p>However, in Nigeria the types of tomatoes could be categorized with their shapes, local names and location of cultivation. They are;</p>\n<table class=\"wp-block-table\">\n<thead>\n<tr>\n<th>Variety</th>\n<th>Place of Cultivation</th>\n<th>Tomatoes Shape</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Yoruba</td>\n<td>Agbara</td>\n<td>Round</td>\n</tr>\n<tr>\n<td>Hausa (Scissors)</td>\n<td>Kano</td>\n<td>Oblong ( pointed tip)</td>\n</tr>\n<tr>\n<td>Tiwantiwa</td>\n<td>Kajola</td>\n<td>Oval</td>\n</tr>\n<tr>\n<td>Hausa</td>\n<td>Sokoto</td>\n<td>Oblong (banana shape)</td>\n</tr>\n<tr>\n<td>Yoruba</td>\n<td>Ogbomosho</td>\n<td>Round</td>\n</tr>\n<tr>\n<td>Beske (Ebira)</td>\n<td>Okene</td>\n<td>Round</td>\n</tr>\n<tr>\n<td>Hausa</td>\n<td>Zaria</td>\n<td>Oblong</td>\n</tr>\n<tr>\n<td>Beske</td>\n<td>Kajola</td>\n<td>Round</td>\n</tr>\n<tr>\n<td>Beske (Ebira)</td>\n<td>Okene</td>\n<td>Oval (folded-in base)</td>\n</tr>\n<tr>\n<td>Hausa</td>\n<td>Zaria</td>\n<td>Oval ( pointed tip)</td>\n</tr>\n<tr>\n<td>Hausa (Scissors)</td>\n<td>Kano</td>\n<td>Oblong (pointed tip)</td>\n</tr>\n<tr>\n<td>Hausa</td>\n<td>Sokoto</td>\n<td>Oval (shield-like)</td>\n</tr>\n<tr>\n<td>Hausa</td>\n<td>Sokoto</td>\n<td>Oblong</td>\n</tr>\n<tr>\n<td>Hausa</td>\n<td>Kano</td>\n<td>Oval</td>\n</tr>\n</tbody>\n</table>\n<p><a href=\"https://www.africabusinessclassroom.com/wp-content/uploads/2017/05/Tomatoe-Farming-In-Nigeria.pdf\">Source Of Table Above</a></p>\n<blockquote class=\"wp-block-quote\">\n<p>If you’re wondering what variety to pick for your tomato farming, then you can go for the recommended type, which is Roma tomato. It’s plum because of its slender and strong nature and is commonly used in Nigeria, growing suitably in any climate.</p>\n</blockquote>\n<figure class=\"wp-block-image\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/TomateTrossRomanaTyp.jpg/800px-TomateTrossRomanaTyp.jpg\" alt=\"Roma Tomatoes\"></figure>\n<h2 id=\"mcetoc_1dbm0fl5l5\"><strong>Planting</strong></h2>\n<h3 id=\"mcetoc_1dbm0fl5l6\">Plant Your Tomato</h3>\n<p>The best way to plant your tomato is by first planting it in the nursery, afterwards transplanting to the field.<br>That is done by covering them with a <a href=\"https://www.facebook.com/Paivkaf-Agrovet-Enterprise-107251979950185/posts\">polyethylene sheet</a> to avoid weed growth, fungus, nematodes, pests, and bacteria. You should look at applying organic fertilizer and manure before planting. Understand that your seed bed ought to be 55-65cm wide, 5-6cm lengthy and 20-25cm high.</p>\n<ul>\n<li>On how best to plant your tomatoes; tomato planting can be carried out around March/April through the starting of raining period. Plant by putting the tomatoes seeds on the soil and cover with 25 % inch level of soil then press it together with your hands or handle (you might cover it with dried out grasses if you would like. This is to avoid loss of moisture).</li>\n<li>After planting, you will notice them growing within the next 5-7 days (after that you can take away the dry grasses to permit for proper growth) then let it grow for about a month or 5 weeks before transplanting to the field.</li>\n</ul>\n<blockquote class=\"wp-block-quote\">\n<p>Your Tomato Nursery can be achieved on a little farm or on your own garden; for those who have one. Ensure that the soil is certainly healthy and looked after well.</p>\n</blockquote>\n<figure class=\"wp-block-image\"><img src=\"http://www.daviddomoney.com/wp-content/uploads/2015/01/tomatoes-on-plant-vine-crop.jpg\" alt=\"Tomatoes can grow anywhere\"></figure>\n<h3 id=\"mcetoc_1dbm0fl5l7\">Transplant Your Tomatoes</h3>\n<p>After a month or five weeks of planting your tomato in the nursery then you can certainly today freely plant them in the field. Tomatoes are extremely fragile and tender, it’s best transplanted the same time you uprooted it from the nursery in order to avoid fatigue and dehydration.</p>\n<ul>\n<li>You must do the transplanting with hand to avoid damages (usually do not use any machines because of this). If your farm is normally large, then you should think about employing even more labors to work with you in this.</li>\n<li>On how best to transplant your tomatoes; You should open up the soil of where you intend to transplant with a little bit of small wood, put in the seedling in to the hole and cover it with loose soil. The soil where you would like to transplant your plant ought to be moist.</li>\n</ul>\n<blockquote class=\"wp-block-quote\">\n<p>Take note; after transplant, the seedbeds ought to be irrigated frequently after sowing and before seedlings reach an elevation of 5 to 7 cm. Do not leave it like that, or else, it will die.</p>\n</blockquote>\n<h3 id=\"mcetoc_1dbm0fl5l8\">Irrigate Your Tomato Farm</h3>\n<p>if you want to obtain the best of your crop; make sure you source your plant with more than enough water. Through the dry season (they are the critical instances), of October and February, be sure you supply your crop with enough water continuously, 3-7 day’s interval (based on the kind of soil). Understand that you shouldn’t place too much drinking water on it to avoid them from cracking.</p>\n<h3 id=\"mcetoc_1dbm0fl5l9\">Weed and Fertilize Your Tomato Farm</h3>\n<p>After one or two weeks of transplanting your tomatoes from the nursery, you should look at weeding your tomato farm. You need to be cautious as you weed to avoid damages on your own tomato crop.</p>\n<ul>\n<li>You may use chemical weed control also, through the use of registered chemicals. Likewise, if you plan to use mechanical solutions to weed, it must be shallow rather than too near to the plant; to avoid damages to the vegetation.</li>\n<li>Fertilizer ought to be applied following the first weeding. That is to greatly help restock the soil nutrients affected or taken by the weeds. For the most part, the fertilizer must have contents like nitrogen, phosphorus, potassium, potash, molybdenum, calcium, and magnesium, and also other trace nutrients, all in adequate volume. Tomato requires these nutrients to develop and flourish.</li>\n</ul>\n<h3 id=\"mcetoc_1dbm0fl5ma\">Control Illnesses and Pests in Your Tomato Farm</h3>\n<p>Aside weed control, you should protect your tomato plant from pests also. Exemplory case of some tomatoes illnesses and pests are;</p>\n<ol>\n<li>Plusia looper</li>\n<li>Cutworm</li>\n<li>Rust mite</li>\n<li>Red spider mite</li>\n<li>Nematodes</li>\n<li>Aphids</li>\n<li>Leaf miner / potato tuber moth</li>\n<li>Bacterial wilt</li>\n<li>Fusarium wilt</li>\n<li>Late blight</li>\n<li>Erinose mite</li>\n<li>Bacterial canker</li>\n<li>Thrips</li>\n</ol>\n<p>These diseases and pests can be managed by;</p>\n<ul>\n<li>Practicing crop rotation.</li>\n<li>Destroying infected plants and discarding them.</li>\n<li>Using registered chemicals.</li>\n<li>Practicing of proper sanitation.</li>\n<li>And controlling drainage.</li>\n</ul>\n<h2 id=\"mcetoc_1dbm0fl5mb\"><strong>Harvesting</strong></h2>\n<h3 id=\"mcetoc_1dbm0fl5mc\">Harvest Your Tomatoes</h3>\n<p>Your tomatoes shall mature after 3 month that’s about 8-12 weeks. At that time, you should begin picking them. LikewiseThe colour should also let you know that it’s ripe . You should pick out your ripe tomatoes regarding to size, color, and quality</p>\n<h3 id=\"mcetoc_1dbm0fl5md\">Store Your Tomatoes</h3>\n<p>If you’re not transferring your tomatoes to the marketplace immediately, you might decide to store your tomatoes. Pack your tomatoes in wooden boxes, cartons or baskets. Store them in an area whose temperature is approximately 12°C and 86% to 90% relative humidity.</p>\n<h3 id=\"mcetoc_1dbm0fl5me\">Market Your Tomatoes</h3>\n<p>After storing and harvesting, then it’s time to sell your tomatoes, <br>it’s extremely important you’ve recognized the best market/retailers to market your tomatoes for because tomatoes are extremely fragile and perishable.</p>\n<p>By the way, unlike rice, cocoa, etc, you cannot store tomatoes for an extended period of time, therefore the market should be ready, before you harvest your tomatoes.</p>\n<p>Please use the <a href=\"http://www.fao.org/agriculture/seed/cropcalendar/welcome.do\">Crop Calendar</a> to learn more information about tomatoes. You can also view more topics at the <a href=\"http://www.worldbank.org/en/topic/agriculture/overview\">World Bank</a> .</p>\n<p>Do you have any questions concerning tomato farming in Nigeria? lets know on our <a href=\"http://localhost/seo/instagram.com/agroconscious\">Instagram Page</a></p>",
            "author": {
                "name": "Agro Blogger"
            },
            "tags": [
            ],
            "date_published": "2019-05-24T23:50:36+01:00",
            "date_modified": "2019-05-24T23:50:36+01:00"
        }
    ]
}
